import 'package:flutter/material.dart';

class PublicAgreement extends StatelessWidget {
  const PublicAgreement({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('Користувацька угода'),),
      body: Padding(
        padding: const EdgeInsets.all(12.0),
        child: ListView(
          children: const [
            Text("""

Договір публічної оферти
Нижченаведений текст є договором між інтернет-магазином, сайт якого розміщений в мережі Інтернет за адресою http://www.comp.kr.ua/, іменованим надалі «Інтернет-магазин» та користувачем послуг Інтернет-магазину, іменований в подальшому «Покупець», і визначає умови придбання товарів через сайт інтернет-магазину.

Загальні положення
1.1. Цей договір є договором публічної оферти (у відповідності зі ст. ст. 633, 641 і гол. 63 Цивільного кодексу України), його умови однакові для всіх покупців незалежно від статусу (фізична особа, юридична особа, фізична особа – підприємець).

1.2. У разі прийняття умов цього договору, тобто публічної оферти Інтернет-магазину, користувач стає Покупцем.

Поняття і визначення
2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають таке значення:
* «Товар» – моделі, аксесуари, комплектуючі та супровідні предмети;
* «Інтернет-магазин» – відповідно до Закону України «про електронну комерцію», засіб для подання або реалізації товару, роботи або послуги шляхом здійснення електронної угоди.
* «Продавець» – компанія, яка реалізує товари, представлені на Інтернет-сайті.
* «Покупець» – фізична особа, що уклала з Продавцем Договір на умовах, викладених нижче.
* «Замовлення» – вибір окремих позицій з переліку товарів, зазначених Покупцем при розміщенні замовлення і проведенні оплати.

Предмет договору
3.1. Продавець зобов’язується передати у власність Покупця Товар, а Покупець зобов’язується оплатити і прийняти Товар на умовах даного Договору.
Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, в тому числі:

добровільний вибір Покупцем товарів в Інтернет-магазині;
самостійне оформлення Покупцем замовлення в Інтернет-магазині;
оплата Покупцем замовлення, оформленого в Інтернет-магазині;
обробка і доставка замовлення Покупцеві у власність на умовах цього Договору.
Порядок оформлення замовлення
4.1. Покупець має право оформити замовлення на будь-який товар, представлений на Сайті Інтернет-магазину і наявний.

4.2. Кожна позиція може бути представлена в замовленні в будь-якій кількості.

4.3. При відсутності товару на складі, Менеджер компанії зобов’язаний поставити Покупця до відома (по телефону або через електронну пошту).

4.4. При відсутності товару Покупець має право замінити його товаром аналогічної моделі, відмовитися від даного товару, анулювати замовлення.

Порядок оплати замовлення
Накладеним платежем
5.1. Оплата здійснюється за фактом отримання товару у відділенні транспортних компанії за готівковий розрахунок в гривнях.

5.2. При не надходженні коштів Інтернет-магазин залишає за собою право анулювати замовлення.

Умови доставки замовлення
6.1. Доставка товарів, придбаних в Інтернет-магазині, здійснюється до складів транспортних компаній, де і здійснюється видача замовлень, або ж через адресну кур’єрську доставку

6.2. Разом із замовленням Покупцеві надаються документи згідно законодавства України.

Права та обов’язки сторін:

7.1. Продавець має право:

в односторонньому порядку припинити надання послуг за цим договором у разі порушення Покупцем умов цього договору.
7.2. Покупець зобов’язаний:

своєчасно оплатити та отримати замовлення на умовах цього договору.
7.3. Покупець має право:

оформити замовлення в Інтернет-магазині;
оформити електронний договір;
вимагати від Продавця виконання умов цього Договору.
Відповідальність сторін
8.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цього договору в порядку, передбаченому цим договором та чинним законодавством України.

8.2. Продавець не несе відповідальності за:

змінений виробником зовнішній вигляд Товару;
за незначне невідповідність колірної гами товару, що може відрізнятися від оригіналу товару виключно через різній колірній передачі моніторів персональних комп’ютерів окремих моделей;
за зміст і правдивість інформації, наданої Покупцем при оформленні замовлення;
за затримку і перебої в наданні Послуг (обробки замовлення та доставки товару), які відбуваються з причин, що знаходяться поза сферою його контролю;
за протиправні незаконні дії, здійснені Покупцем за допомогою даного доступу до мережі Інтернет;
за передачу Покупцем своїх мережевих ідентифікаторів – IP, MAC-адреси, логіну і пароля третім особам;
8.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет, самостійно несе відповідальність за шкоду, заподіяну його діями (особисто, навіть якщо під його логіном знаходилося іншу особу) особам або їх майну, юридичним особам, державі чи моральним принципам моральності.

8.4. У разі настання обставин непереборної сили, сторони звільняються від виконання умов цього договору. Під обставинами непереборної сили для цілей цього договору розуміються події, що мають надзвичайний, непередбачений характер, які виключають або об’єктивно заважають виконанню цього договору, настання яких Сторони не могли передбачити і запобігти розумними способами.

8.5. Сторони прикладають максимум зусиль для вирішення будь-яких розбіжностей виключно шляхом переговорів.

Інші умови
9.1. Інтернет-магазин залишає за собою право в односторонньому порядку вносити зміни до цього договору за умови попередньої публікації його на сайті https://prolum.com.ua

9.2. Інтернет-магазин створений для організації дистанційного способу продажу товарів через Інтернет.

9.3. Покупець несе відповідальність за достовірність інформації, зазначеної при оформленні замовлення інформації. При цьому, при здійсненні акцепту (оформленні замовлення і подальшої оплати товару) Покупець надає Продавцю свою беззастережну згоду на збір, обробку, зберігання, використання своїх персональних даних, в розумінні ЗУ «Про захист персональних даних».

9.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення означає повну згоду Покупця з умовами договору купівлі-продажу (публічної оферти)

9.5. Фактичною датою електронного угоди між сторонами є дата прийняття умов, відповідно до ст. 11 Закону України «Про електронну комерцію»

9.6. Використання ресурсу Інтернет-магазину для попереднього перегляду товару, а також для оформлення замовлення для Покупця є безкоштовним.

9.7. Інформація, яку надає Покупцем є конфіденційною. Інтернет-магазин використовує інформацію про Покупця виключно в цілях обробки замовлення, відправлення повідомлень Покупцеві, доставки товару, здійснення взаєморозрахунків і ін.

Порядок повернення товару належної якості
10.1. Повернення товару в Інтернет-магазин проводиться згідно чинного законодавства України.

10.2. Повернення товару в Інтернет-магазин проводиться за рахунок Покупця.

10.3. При поверненні Покупцем товару належної якості, Інтернет-магазин повертає йому сплачену за товар грошову суму за фактом повернення товару за вирахуванням компенсації витрат Інтернет-магазину пов’язаних з доставкою товару Покупцеві.

Термін дії договору
11.1.Електронний договір вважається укладеним з моменту одержання особою яка направила пропозицію укласти такий договір, відповіді про прийняття цієї пропозиції в порядку, визначеному частиною шостою статті 11 Закону України “Про електронну комерцію”.

11.2. До закінчення терміну дії цей Договір може бути розірваний за взаємною згодою сторін до моменту фактичної доставки товару, шляхом повернення грошових коштів

11.3. Сторони мають право розірвати цей договір в односторонньому порядку, в разі невиконання однією із сторін умов цього Договору та у випадках передбачених чинним законодавством України.
            
            """)
          ],
        ),
      ),
    );
  }
}
